Repository: NehalShinde03/flutter-localization
Catalog: lib/l10n/intl_*.arb
Languages: ar, es, fr, it, tr

source: Change Language
ar: تغيير اللغة
es: Cambiar idioma
fr: Changer de langue
it: Cambia lingua
tr: Dili Değiştir

# findingTheMapAryanDiscoversAnOldMysteriousMapIn
source: Finding the Map – Aryan discovers an old, mysterious map in an antique shop.
ar: العثور على الخريطة – يكتشف آريان خريطة قديمة وغامضة في متجر للتحف.
es: Encontrar el mapa: Aryan descubre un mapa antiguo y misterioso en una tienda de antigüedades.
fr: Trouver la carte – Aryan découvre une vieille et mystérieuse carte dans un magasin d'antiquités.
it: Alla ricerca della mappa – Aryan scopre un'antica e misteriosa mappa in un negozio di antiquariato.
tr: Haritayı Bulma – Aryan bir antika dükkanında eski, gizemli bir harita keşfeder.

# theAdventureBeginsHeSetsOutOnAJourneyTo
source: The Adventure Begins – He sets out on a journey to uncover its secrets.
ar: تبدأ المغامرة – ينطلق في رحلة لكشف أسرارها.
es: Comienza la aventura: emprende un viaje para descubrir sus secretos.
fr: L'aventure commence – Il se lance dans un voyage pour découvrir ses secrets.
it: L'avventura ha inizio: intraprende un viaggio per scoprirne i segreti.
tr: Macera Başlıyor – Sırlarını ortaya çıkarmak için bir yolculuğa çıkıyor.

# theForestChallengeHeEntersADenseForestWhereThe
source: The Forest Challenge – He enters a dense forest, where the path vanishes.
ar: تحدي الغابة – يدخل غابة كثيفة، حيث يختفي المسار.
es: The Forest Challenge: entra en un denso bosque, donde el camino desaparece.
fr: Le défi forestier – Il entre dans une forêt dense, où le chemin disparaît.
it: The Forest Challenge – Entra in una fitta foresta, dove il sentiero svanisce.
tr: Orman Mücadelesi - Yolun kaybolduğu yoğun bir ormana girer.

# aLoyalCompanionAStrayDogShadowJoinsHimOn
source: A Loyal Companion – A stray dog, Shadow, joins him on the journey.
ar: الرفيق المخلص – ينضم إليه في الرحلة كلب ضال يُدعى شادو.
es: Un compañero leal: Un perro callejero, Shadow, se une a él en el viaje.
fr: Un compagnon fidèle – Un chien errant, Shadow, le rejoint dans son voyage.
it: Un compagno fedele – Un cane randagio, Shadow, si unisce a lui nel viaggio.
tr: Sadık Bir Yoldaş – Yolculukta başıboş bir köpek olan Shadow ona katılır.

# theHiddenCaveTheyDiscoverAnAncientCaveMarkedOn
source: The Hidden Cave – They discover an ancient cave marked on the map.
ar: الكهف المخفي - اكتشفوا كهفًا قديمًا محددًا على الخريطة.
es: La Cueva Oculta – Descubren una cueva antigua marcada en el mapa.
fr: La grotte cachée – Ils découvrent une ancienne grotte indiquée sur la carte.
it: La grotta nascosta – Scoprono un'antica grotta segnata sulla mappa.
tr: Gizli Mağara – Haritada işaretlenmiş eski bir mağarayı keşfederler.

# theRiddleTestAryanSolvesAStoneDoorsRiddleTo
source: The Riddle Test – Aryan solves a stone door’s riddle to proceed.
ar: اختبار اللغز – يحل آريان لغز الباب الحجري للمضي قدمًا.
es: La prueba del acertijo: Aryan resuelve el acertijo de una puerta de piedra para continuar.
fr: Le test de l'énigme – Aryan résout l'énigme d'une porte en pierre pour continuer.
it: The Riddle Test – Aryan risolve l’enigma di una porta di pietra per procedere.
tr: Bilmece Testi – Aryan ilerlemek için taş bir kapının bilmecesini çözer.

# theRealTreasureInsteadOfGoldHeFindsAnExplorers
source: The Real Treasure – Instead of gold, he finds an explorer’s journal full of wisdom.
ar: الكنز الحقيقي - بدلاً من الذهب، وجد مجلة مستكشف مليئة بالحكمة.
es: El verdadero tesoro: en lugar de oro, encuentra el diario de un explorador lleno de sabiduría.
fr: Le vrai trésor – Au lieu d’or, il trouve un journal d’explorateur plein de sagesse.
it: Il vero tesoro – Invece dell’oro, trova il diario di un esploratore pieno di saggezza.
tr: Gerçek Hazine – Altın yerine, bilgelikle dolu bir kaşifin günlüğünü bulur.

source: The Journey Back – Aryan returns home, changed by his experience.
ar: رحلة العودة - يعود آريان إلى .لمنزل وقد غيرته تجربته.
es: El viaje de regreso: Aryan regresa a casa, cambiado por su experiencia.
fr: Le voyage de retour – Aryan rentre chez lui, changé par son expérience.
it: Il viaggio di ritorno – Aryan torna a casa, cambiato dalla sua esperienza.
tr: Geri Yolculuk – Aryan, deneyimiyle değişmiş olarak eve döner.

# aNewPurposeHeBecomesAStorytellerInspiringOthersWith
source: A New Purpose – He becomes a storyteller, inspiring others with his adventure.
ar: غرض جديد – يصبح راويًا للقصص، ويلهم الآخرين بمغامرته.
es: Un nuevo propósito: se convierte en un narrador e inspira a otros con su aventura.
fr: Un nouvel objectif – Il devient un conteur, inspirant les autres avec son aventure.
it: Un nuovo scopo – Diventa un narratore, ispirando gli altri con la sua avventura.
tr: Yeni Bir Amaç – Macerasıyla başkalarına ilham veren bir hikaye anlatıcısı olur.

source: First View
ar: العرض الأول
es: Primera vista
fr: Première vue
it: Prima vista
tr: İlk Görünüm

source: Every day is a fresh start filled with new opportunities.
ar: كل يوم هو بداية جديدة مليئة بالفرص الجديدة.
es: Cada día es un nuevo comienzo lleno de nuevas oportunidades.
fr: Chaque jour est un nouveau départ rempli de nouvelles opportunités.
it: Ogni giorno è un nuovo inizio pieno di nuove opportunità.
tr: Her gün yeni fırsatlarla dolu yeni bir başlangıçtır.

source: I am capable, strong, and ready to succeed.
ar: أنا قادر وقوي ومستعد للنجاح.
es: Soy capaz, fuerte y listo para triunfar.
fr: Je suis capable, fort et prêt à réussir.
it: Sono capace, forte e pronto ad avere successo.
tr: Yetenekliyim, güçlüyüm ve başarmaya hazırım.

# happinessIsAChoiceAndIChooseToBeHappy
source: Happiness is a choice, and I choose to be happy today.
ar: السعادة اختيار، وأنا اخترت أن أكون سعيدًا اليوم.
es: La felicidad es una elección y yo elijo ser feliz hoy.
fr: Le bonheur est un choix, et je choisis d'être heureux aujourd'hui.
it: La felicità è una scelta e io scelgo di essere felice oggi.
tr: Mutluluk bir seçimdir ve ben bugün mutlu olmayı seçiyorum.

source: Challenges are just opportunities for growth.
ar: التحديات هي مجرد فرص للنمو.
es: Los desafíos son sólo oportunidades de crecimiento.
fr: Les défis ne sont que des opportunités de croissance.
it: Le sfide sono solo opportunità di crescita.
tr: Zorluklar sadece büyüme fırsatlarıdır.

source: I attract positivity and good things into my life.
ar: أجذب الإيجابية والأشياء الجيدة إلى حياتي.
es: Atraigo positividad y cosas buenas a mi vida.
fr: J'attire la positivité et les bonnes choses dans ma vie.
it: Attiro positività e cose buone nella mia vita.
tr: Pozitifliği ve iyi şeyleri hayatıma çekiyorum.

# myDreamsAreValidAndIAmOnTheRight
source: My dreams are valid, and I am on the right path.
ar: أحلامي صحيحة، وأنا على الطريق الصحيح.
es: Mis sueños son válidos y estoy en el camino correcto.
fr: Mes rêves sont valables et je suis sur la bonne voie.
it: I miei sogni sono validi e sono sulla strada giusta.
tr: Hayallerim geçerli ve doğru yoldayım.

source: Small progress is still progress—keep going!
ar: التقدم البسيط لا يزال يمثل تقدمًا، استمر في التقدم!
es: Un pequeño progreso sigue siendo progreso: ¡sigue adelante!
fr: De petits progrès restent des progrès : continuez !
it: I piccoli progressi sono pur sempre progressi: continua così!
tr: Küçük ilerleme hala ilerlemedir; devam edin!

source: Everything I need to succeed is already within me.
ar: كل ما أحتاجه للنجاح موجود بداخلي بالفعل.
es: Todo lo que necesito para triunfar ya está dentro de mí.
fr: Tout ce dont j'ai besoin pour réussir est déjà en moi.
it: Tutto ciò di cui ho bisogno per avere successo è già dentro di me.
tr: Başarılı olmak için ihtiyacım olan her şey zaten içimde.

source: The best is yet to come!
ar: الأفضل لم يأت بعد!
es: ¡Lo mejor está por llegar!
fr: Le meilleur est à venir !
it: Il meglio deve ancora venire!
tr: En iyisi henüz gelmedi!

source: I believe in myself and my journey.
ar: أنا أؤمن بنفسي وبرحلتي.
es: Creo en mí mismo y en mi viaje.
fr: Je crois en moi et en mon parcours.
it: Credo in me stesso e nel mio viaggio.
tr: Kendime ve yolculuğuma inanıyorum.

source: Second View
ar: العرض الثاني
es: Segunda vista
fr: Deuxième vue
it: Seconda vista
tr: İkinci Görünüm

source: Next
ar: التالي
es: Próximo
fr: Suivant
it: Prossimo
tr: Sonraki

source: Select Language
ar: اختر اللغة
es: Seleccionar idioma
fr: Sélectionnez la langue
it: Seleziona lingua
tr: Dil Seçiniz

source: Save
ar: يحفظ
es: Ahorrar
fr: Sauvegarder
it: Salva
tr: Kaydetmek
